  
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;

	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл

		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ФактическийАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
		КонецЕсли;

		КонтрагентОбъект.Записать();

	КонецЦикла;

КонецПроцедуры