
&НаКлиенте
Процедура Сложить(Команда)
  Результат = Результат + Значение;
КонецПроцедуры

&НаКлиенте
Процедура Вычесть(Команда)
	Результат = Результат - Значение;
КонецПроцедуры

&НаКлиенте
Процедура Разделить(Команда)
	Результат = Результат / Значение;
КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)
	Результат = Результат * Значение;
КонецПроцедуры

&НаКлиенте
Процедура ОбменятьЗначениеРезультат(Команда)
	Перем1 = Значение;
	Значение = Результат;
	Результат = Перем1;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРезультатКПамяти(Команда)
	Память= Результат + Память;
КонецПроцедуры

&НаКлиенте
Процедура ВычестьРезультатИзПамяти(Команда)
	Память= Результат - Память;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПамять(Команда)
	Память = "0";
КонецПроцедуры

&НаКлиенте
Процедура ПамятьВЗначение(Команда)
	Значение = Память
КонецПроцедуры
