
Функция ИННВерен(Знач ИНН) Экспорт 
	
	Если СтрДлина(ИНН) = 12 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрДлина(ИНН) <> 10 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Множитель = Новый Массив(9);   
	Множитель[0] = 2;
	Множитель[1] = 4; 
	Множитель[2] = 10;
	Множитель[3] = 3; 
	Множитель[4] = 5; 
	Множитель[5] = 9;
	Множитель[6] = 4;
	Множитель[7] = 6;
	Множитель[8] = 8;   

	КонтрольнаяСумма = 0;

		Для Сч = 0 По 8 Цикл
		КонтрольнаяСумма = КонтрольнаяСумма + Множитель[Сч] * Число(Сред(ИНН, Сч + 1, 1));	
		КонецЦикла;
		
		КонтрольныйРазряд = КонтрольнаяСумма % 11 % 10;  
		
		Возврат КонтрольныйРазряд = Число(Прав(ИНН, 1));
	
КонецФункции