
Процедура ПриНачалеРаботыСистемы()
	Сообщить("При начале работы системы: " + КонтекстВыполненияКлиентСервер.ТекущийКонтекст());     
	ПредупреждениеАсинх("Приложение на платформе 1С:Предприятие 8 готово к работе");  
	
	ДатаСегодня = '20250101100000';
	
	ОтформатированнаяДата = Формат(ДатаСегодня, "ДФ=dd.MM");
	
	НачалоРабочегоДняСегодня = Дата(Год(ДатаСегодня),Месяц(ДатаСегодня), День(ДатаСегодня), 9, 00, 00);
	
	ПрошлоВремениСНачалоРабочегоДня = ДатаСегодня - НачалоРабочегоДняСегодня; 
	
	МинутСНачараРабочегоДня = Цел(ПрошлоВремениСНачалоРабочегоДня / 60);
	
	ТекстСообщения = СтрШаблон("Сегодня: %1, минут с начала рабочего дня: %2 ",ОтформатированнаяДата, МинутСНачараРабочегоДня);
	Сообщить(ТекстСообщения);  
	
	
	ДатаСегодняФормат = Формат( ТекущаяДата() , "ДФ=дддд");
	НачалоРабочегоДня = НачалоДня (ДатаСегодня)+32400 ;
	КонецРабочегоДня = НачалоРабочегоДня + 60 * 60 * 9;
	
	ДеньНеделиСегодня = ДеньНедели (ДатаСегодня);
	
	Если ДеньНеделиСегодня= 1 тогда
		Сегодня = "Понеделльник";
	КонецЕсли; 
	Если ДеньНеделиСегодня =2 тогда
		Сегодня = "Вторник";
	КонецЕсли;
	Если ДеньНеделиСегодня =3 тогда
		Сегодня = "Среда";
	КонецЕсли;
	Если ДеньНеделиСегодня =4 тогда
		Сегодня = "Четверг";
	КонецЕсли;
	Если ДеньНеделиСегодня =5 тогда
		Сегодня = "Пятница";                                  	
	КонецЕсли;
	Если ДеньНеделиСегодня =6 тогда
		Сегодня ="Суббота";
	КонецЕсли; 
	Если ДеньНеделиСегодня =7 тогда
		Сегодня = "Воскресенье";
	КонецЕсли;
	Если ДеньНеделиСегодня = 6 или ДеньНеделиСегодня = 7 Тогда
		ТекстСообщения = СтрШаблон ( "Сегодня %1, выходной день.",Сегодня); 
	Иначе 
		Если ДатаСегодня > НачалоРабочегоДня И ДатаСегодня < КонецРабочегоДня Тогда
			СостояниеРабочегоВремени = "Рабочее время идет";
		ИначеЕсли  ДатаСегодня > КонецРабочегоДня Тогда
			СостояниеРабочегоВремени = "Рабочее время завершилось";
		ИначеЕсли  ДатаСегодня < НачалоРабочегоДня Тогда
			СостояниеРабочегоВремени = "Рабочее время еще не началось" ;
		КонецЕсли;
		ТекстСообщения = СтрШаблон ( "Сегодня : %1,будний день, %2 ",Сегодня, СостояниеРабочегоВремени);
	КонецЕсли;  
	Сообщить (ТекстСообщения);
	
	Сегодня = НачалоДня(ТекущаяДата());
	Завтра = Сегодня + 86400; 
	ПраздничныеДаты = Новый Массив;
	
	НовыйГод = Новый Структура;
	НовыйГод.Вставить ("Название", "Новый год");
	НовыйГод.Вставить("День", 1);
	НовыйГод.Вставить("Месяц", 1);
	ПраздничныеДаты.Добавить(НовыйГод);
	
	ВосьмоеМарта = Новый Структура;
	ВосьмоеМарта.Вставить("Название", "Восьмое марта");
	ВосьмоеМарта.Вставить("День", 8); 
	ВосьмоеМарта.Вставить("Месяц", 3);
	ПраздничныеДаты.Добавить(ВосьмоеМарта);
	
	Для Каждого СписокПраздников Из ПраздничныеДаты Цикл 
		Если День(Сегодня) = СписокПраздников.День И Месяц(Сегодня) = СписокПраздников.Месяц Тогда 			
			Сообщить(СтрШаблон("Поздравляем с праздником: %1", СписокПраздников.Название));  
		ИначеЕсли День(Завтра) = СписокПраздников.День И Месяц(Завтра) = СписокПраздников.Месяц Тогда 			
			Сообщить(СтрШаблон("Завтра праздник: %1", СписокПраздников.Название));
		КонецЕсли;
	КонецЦикла; 

	ДеньРожденияПользователя = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	Если День(ТекущаяДата()) = День(ДеньРожденияПользователя) И Месяц(ТекущаяДата()) = Месяц(ДеньРожденияПользователя) Тогда 
		Сообщить("У вас сегодня день рождения - Поздравляем!");
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();
КонецПроцедуры















